insert into
   jrs_bic_bank
(
  bic
  , bankname
  , ks
)
select
  s.bic
  , s.bankname
  , s.ks
from
  (
  select '044585187' as bic, 'юйа "лняйнбяйхи бейяекэмши аюмй" (гюн)' as bankname, '30101810500000000187' as ks from dual
  union all select '044525448', 'юйа "ъош йпедх аюмй лняйбю" (гюн)', '30101810300000000448' from dual
  union all select '044585216', 'ннн "уйт аюмй"', '30101810400000000216' from dual
  union all select '044525375', 'аюмй "янтпхмн" (гюн)', '30101810800000000375' from dual
  union all select '044525236', 'гюн "аюмй йпедхр ябхяя (лняйбю)"', '30101810800000000236' from dual
  union all select '044585237', 'нюн "лефрнощмепцнаюмй"', '30101810900000000237' from dual
  union all select '044585238', 'юйа "юоюаюмй" (гюн)', '30101810200000000238' from dual
  union all select '044585249', 'йа "хмтнплопнцпеяя" (ннн)', '30101810600000000249' from dual
  union all select '044585250', 'юйа "боа" (гюн)', '30101810000000000250' from dual
  union all select '044585252', 'ннн йа "юсщпаюмй"', '30101810600000000252' from dual
  union all select '044585253', 'гюн йа "псакеб"', '30101810900000000253' from dual
  union all select '044585257', 'нюн "птй-аюмй"', '30101810100000000257' from dual
  union all select '044585259', 'юйа "оепеябер" (гюн)', '30101810700000000259' from dual
  union all select '044585260', 'нюн йа "лнябнднйюмюкаюмй"', '30101810100000000260' from dual
  union all select '041117601', 'нрдекемхе N8637 яаепаюмйю пняяхх', '30101810100000000601' from dual
  union all select '041909769', 'аюмй "яебепмши йпедхр" (нюн)', '30101810500000000769' from dual
  union all select '041117770', 'гюн ярпнийнлаюмй', '30101810400000000770' from dual
  union all select '041203602', 'нрдекемхе N8625 яаепаюмйю пняяхх', '30101810500000000602' from dual
  union all select '041203709', 'т-к цоа (нюн) б ц.юярпюуюмх', '30101810500000000709' from dual
  union all select '041203711', 'нюн аюмй "ййа"', '30101810200000000711' from dual
  union all select '041203715', 'нюн еюроаюмй', '30101810400000000715' from dual
  union all select '041203726', 'нюн юцпнхмйнлаюмй', '30101810800000000726' from dual
  union all select '041203729', 'нюн бйюаюмй', '30101810700000000729' from dual
  union all select '041203738', 'юярпюуюмяйхи тхкхюк нюн юйа "ябъгэ-аюмй"', '30101810500000000738' from dual
  union all select '041203746', 'тхкхюк гюн "пяйа" б ц.юярпюуюмэ', '30101810000000000746' from dual
  union all select '041403783', 'гюн "бщкрнм аюмй"', '30101810500000000783' from dual
  union all select '041403633', 'нрдекемхе N8592 яаепаюмйю пняяхх', '30101810100000000633' from dual
  union all select '041403701', 'гюн сйа "аекцнпндянжаюмй"', '30101810100000000701' from dual
  union all select '041403747', 'нюн "яебепхмбеяраюмй"', '30101810300000000747' from dual
  union all select '044585416', 'йхбх аюмй (гюн)', '30101810200000000416' from dual
  union all select '041424711', 'ярюпнняйнкэяйхи т-к гюн сйа "аекцнпндянжаюмй"', '30101810700000000711' from dual
  union all select '041424725', 'ннн "няйнкаюмй"', '30101810000000000725' from dual
  union all select '041501601', 'нрдекемхе N8605 яаепаюмйю пняяхх', '30101810400000000601' from dual
  union all select '041708602', 'нрдекемхе N8611 яаепаюмйю пняяхх', '30101810000000000602' from dual
  union all select '041708703', 'бкюдхлхпяйхи тхкхюк юоа "янкхдюпмнярэ"', '30101810200000000703' from dual
  union all select '041708706', 'гюн "бкюдахгмеяаюмй"', '30101810100000000706' from dual
  union all select '041708708', 'ннн "бкюдопнлаюмй"', '30101810700000000708' from dual
  union all select '041708716', 'тхкхюк бпс нюн "лхма"', '30101810200000000716' from dual
  union all select '041806647', 'нрдекемхе N8621 яаепаюмйю пняяхх', '30101810100000000647' from dual
  union all select '041806779', 'т-к цоа (нюн) б ц.бнкцнцпюде', '30101810900000000779' from dual
  union all select '044030815', 'ннн йа "хмбеяр-щйнаюмй"', '30101810500000000815' from dual
  union all select '041806791', 'нюн йа "псячцаюмй"', '30101810700000000791' from dual
  union all select '041806799', 'нюн "юйа"йнп"', '30101810100000000799' from dual
  union all select '041806813', 'бт юйа "хпя" (гюн)', '30101810400000000813' from dual
  union all select '041806824', 'бнкцнцпюдяйхи т аюмйю"бнгпнфдемхе"(нюн)', '30101810800000000824' from dual
  union all select '044030892', 'гюн юйа "аюмйхпяйхи днл"', '30101810400000000892' from dual
  union all select '044579124', 'юйа "хмйюпнаюмй" (гюн)', '30101810300000000124' from dual
  union all select '044579128', '"тхмюпя аюмй" (гюн)', '30101810500000000128' from dual
  union all select '044525116', '"гепаюмй (лняйбю)"(гюн)', '30101810700000000116' from dual
  union all select '044579131', 'ннн йа "юдлхпюкреияйхи"', '30101810500000000131' from dual
  union all select '044579132', 'ннн йа "ебпнюгхюряйхи хмбеярхжхнммши аюмй"', '30101810800000000132' from dual
  union all select '044585715', 'тхкхюк нюн юйа "щкэахм" б ц.лняйбю', '30101810600000000715' from dual
  union all select '044579146', 'йа яяяа (ннн)', '30101810100000000146' from dual
  union all select '044585453', 'йа "пемрю-аюмй" нюн', '30101810700000000453' from dual
  union all select '044579505', 'юйа "ярпюрецхъ" (нюн)', '30101810000000000505' from dual
  union all select '044579154', 'юйа "хмрпюяраюмй" (нюн)', '30101810600000000154' from dual
  union all select '044579158', 'йа "мя аюмй"(гюн)', '30101810800000000158' from dual
  union all select '044579162', 'йа "атц-йпедхр" (ннн)', '30101810100000000162' from dual
  union all select '044579194', 'юйа "ебпнлер" (нюн)', '30101810000000000194' from dual
  union all select '044579171', 'юйа "югхлср" (нюн)', '30101810900000000171' from dual
  union all select '044579174', 'нюн "пця аюмй"', '30101810800000000174' from dual
  union all select '044525534', 'нюн аюмй "гюоюдмши"', '30101810900000000534' from dual
  union all select '044525204', 'нюн юйа "ебпнтхмюмя лнямюпаюмй"', '30101810900000000204' from dual
  union all select '044583104', 'юй та хммнбюжхи х пюгбхрхъ (гюн)', '30101810000000000104' from dual
  union all select '044579828', 'ннн йа "аюмй пюявернб х яаепефемхи"', '30101810800000000828' from dual
  union all select '044525213', 'юйа "аюмй йхрюъ (щкня)"', '30101810700000000213' from dual
  union all select '044583123', 'лащя', '30101810900000000123' from dual
  union all select '044583131', 'юйа "ремдеп-аюмй" (гюн)', '30101810400000000131' from dual
  union all select '044583133', 'нюн "лняйкхпхмцжемрп"', '30103810600000000133' from dual
  union all select '044525219', 'нюн "аюмй лняйбш"', '30101810500000000219' from dual
  union all select '048952630', 'ннн йа "хмрепйюохрюк-аюмй"', '30101810800000000630' from dual
  union all select '044583139', 'ябъгмни аюмй (гюн)', '30101810800000000139' from dual
  union all select '044585166', 'нюн "рщлап-аюмй"', '30101810000000000166' from dual
  union all select '044579852', 'йа "мла" ннн', '30101810300000000852' from dual
  union all select '044583151', 'гюн "аюмй псяяйхи ярюмдюпр"', '30101810600000000151' from dual
  union all select '044525218', 'йа "дф.о. лнпцюм аюмй хмрепмеьмк" (ннн)', '30101810200000000218' from dual
  union all select '044583162', 'гюн юйа "мнбхйнлаюмй"', '30101810000000000162' from dual
  union all select '044585209', 'гюн "л аюмй"', '30101810200000000209' from dual
  union all select '044599780', 'юйа "унбюмяйхи" (гюн)', '30101810700000000780' from dual
  union all select '044583695', 'нюн аюмй "яндпсфеярбн"', '30101810700000000695' from dual
  union all select '044585413', 'йа "мюжхмбеяропнлаюмй" (гюн)', '30101810300000000413' from dual
  union all select '044525195', 'ннн йа "тда"', '30101810200000000195' from dual
  union all select '044525226', 'юа "цоа-хонрейю" (нюн)', '30101810700000000226' from dual
  union all select '044583209', 'аюмй "мнбши яхлбнк" (гюн)', '30101810400000000209' from dual
  union all select '044583211', 'гюн "пяйа"', '30101810100000000211' from dual
  union all select '044525239', 'ннн йа "тхмрпюяраюмй"', '30101810700000000239' from dual
  union all select '044579228', 'йа лйа (ннн)', '30101810400000000228' from dual
  union all select '044583228', 'йа "йсрсгнбяйхи" ннн', '30101810300000000228' from dual
  union all select '044579361', 'йа "лтаюмй" ннн', '30101810600000000361' from dual
  union all select '044525247', 'аюмй "щйяон йюохрюк" (ннн)', '30101810200000000247' from dual
  union all select '044583303', 'нюн люа "релоаюмй"', '30101810500000000303' from dual
  union all select '044525401', 'юа "юяоейр" (гюн)', '30101810800000000401' from dual
  union all select '041806831', 'нюн мнйяяаюмй', '30101810000000000831' from dual
  union all select '041817774', 'спчохмяйхи тхкхюк нюн юйа "яекэлюьаюмй"', '30101810600000000774' from dual
  union all select '041814815', 'нюн йа "лхуюикнбяйхи офяа"', '30101810500000000815' from dual
  union all select '043469743', 'ннн хйа "янбйнлаюмй"', '30101810300000000743' from dual
  union all select '043601607', 'онбнкфяйхи аюмй нюн "яаепаюмй пняяхх"', '30101810200000000607' from dual
  union all select '043601706', 'нюн йа "янкхдюпмнярэ"', '30101810800000000706' from dual
  union all select '043606811', 'гюн юйа "геляйхи аюмй"', '30101810800000000811' from dual
  union all select '044599603', 'гюн "хонрей аюмй"', '30101810900000000603' from dual
  ) s
where
  not exists
    (
    select
      null
    from
       jrs_bic_bank t
    where
      t.bic = s.bic
    )
/

commit
/
